{
  "en": {
    "home": "Home",
    "about-me": "About Me",
    "experience": "Experience",
    "projects": "Projects",
    "education": "Education",
    "courses": "Courses",
    "contact": "Contact",
    "navbar-brand": "YR",
    "meta-description": "Curriculum of Yulibeth Rivero, web developer with experience in HTML5, CSS3, JavaScript, and Angular. Focused on efficient and high-quality solutions.",
    "download-cv": "Download CV",
    "home-title": "Hi, I'm Yulibeth!",
    "home-subtitle": "Front End Web Developer",
    "home-description": "Passionate about web development and motivated by the latest technological trends, I specialize in frontend with Angular; I have experience in dynamic projects and Agile methodologies.",
    "about-me-title": "About Me",
    "about-me-description-1": "Since 2016, I have been working in web development with a variety of technologies in design, frontend, and backend. Additionally, I have experience working in teams that implement Agile methodologies. Since 2022, I have specialized in frontend, completing an Angular bootcamp at IT Academy and others in Vue.js at La Salle University Ramon Llull and Eurecat. As a final project in Angular, I developed an application for room search by geolocation, integrating advanced features such as user authentication, password encryption, and session management with JWT, using Angular, Nest, MySQL, Mapbox, and TailwindCSS. The demonstration is available at&nbsp;<a href=\"https://ezhub.vercel.app/\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"Go to the project demonstration on ezhub.vercel.app\">the project demonstration</a>.",
    "about-me-description-2": "As a Front End Developer with Angular at IT Academy, I collaborated on the ITA Challenges project, an application for programming challenges. My role included implementing interactive features, unit testing with Jest, and task management on GitHub. The project code is available at&nbsp;<a href=\"https://github.com/IT-Academy-BCN/ita-challenges-frontend\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"Go to the project code on GitHub\">the project's GitHub repository</a>.",
    "tech-skills-title": "Tech Skills",
    "tech-skills-description": "In my career, I have worked with a variety of technologies, such as:",
    "tech-skills-frontend": "Frontend",
    "tech-skills-frontend-description": "Interface development with Angular, Vue, JavaScript, TypeScript, HTML5, CSS3, Sass, Bootstrap, TailwindCSS, jQuery, and Jest.",
    "tech-skills-backend": "Backend",
    "tech-skills-backend-description": "Maintenance and development with Nest, MySQL, and PHP (mainly used in WordPress, PrestaShop, and Magento).",
    "tech-skills-design": "Design",
    "tech-skills-design-description": "Creating attractive and accessible interfaces with a focus on usability using Photoshop, Illustrator, Adobe XD, and Figma.",
    "tech-skills-others": "Others",
    "tech-skills-others-description": "Experience in project management and version control for a collaborative workflow with Scrum, Git, GitHub, and Postman.",
    "soft-skills-title": "Soft Skills",
    "soft-skills-description": "I am autonomous, flexible, and detail-oriented. I enjoy teamwork and idea exchange, always with a focus on common goals. I am always open to new opportunities to continue growing in web development.",
    "soft-skills-autonomy": "Autonomy",
    "soft-skills-achievement-orientation": "Achievement Orientation",
    "soft-skills-teamwork": "Teamwork"
  },
  "es": {
    "home": "Inicio",
    "about-me": "Sobre Mí",
    "projects": "Proyectos",
    "experience": "Experiencia",
    "education": "Educación",
    "courses": "Cursos",
    "contact": "Contacto",
    "navbar-brand": "YR",
    "meta-description": "Currículum de Yulibeth Rivero, desarrolladora web con experiencia en HTML5, CSS3, JavaScript y Angular. Enfocada en soluciones eficientes y de alta calidad.",
    "download-cv": "Descargar CV",
    "home-title": "Hola, soy Yulibeth!",
    "home-subtitle": "Front End Web Developer",
    "home-description": "Apasionada por el desarrollo web y motivada por las últimas tendencias tecnológicas, estoy especializada en frontend con Angular; tengo experiencia en proyectos dinámicos y en metodologías Agile.",
    "about-me-title": "Sobre mí",
    "about-me-description-1": "Desde 2016, trabajo en el desarrollo web con una variedad de tecnologías en diseño, frontend y backend. Además, tengo experiencia trabajando en equipos que implementan metodologías Agile. Desde 2022, me he especializado en frontend, completando un bootcamp de Angular en IT Academy y otros de Vue.js en La Salle Universidad Ramon Llull y en Eurecat. Como proyecto final en Angular, desarrollé una aplicación para la búsqueda de habitaciones por geolocalización, integrando características avanzadas como autenticación de usuarios, encriptación de contraseñas y gestión de sesiones con JWT, utilizando Angular, Nest, MySQL, Mapbox y TailwindCSS. La demostración está disponible en&nbsp;<a href=\"https://ezhub.vercel.app/\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"Ir a la demostración del proyecto EZHub\">la&nbsp;demo&nbsp;de&nbsp;EZHub</a>.",
    "about-me-description-2": "Como Front End Developer con Angular en la IT Academy, colaboré en el proyecto ITA Challenges, una aplicación para realizar retos de programación. Su función incluyó la implementación de características interactivas, pruebas unitarias con Jest y la gestión de tareas en GitHub. El código está disponible en el&nbsp;<a href=\"https://github.com/IT-Academy-BCN/ita-challenges-frontend\" target=\"_blank\" rel=\"noopener noreferrer\" aria-label=\"Ir al repositorio de GitHub del proyecto ITA Challenges\">repositorio de GitHub del&nbsp;proyecto</a>.",
    "tech-skills-title": "Tech Skills",
    "tech-skills-description": "En mi carrera, he trabajado con una variedad de tecnologías, como:",
    "tech-skills-frontend": "Front End",
    "tech-skills-frontend-description": "Desarrollo de interfaces con Angular, Vue, JavaScript, TypeScript, HTML5, CSS3, Sass, Bootstrap, TailwindCSS, jQuery y Jest.",
    "tech-skills-backend": "Back End",
    "tech-skills-backend-description": "Mantenimiento y desarrollo con Nest, MySQL y PHP (principalmente utilizado en WordPress, PrestaShop y Magento).",
    "tech-skills-design": "Diseño",
    "tech-skills-design-description": "Creación de interfaces atractivas y accesibles con un enfoque en la usabilidad utilizando Photoshop, Illustrator, Adobe XD y Figma.",
    "tech-skills-others": "Otros",
    "tech-skills-others-description": "Experiencia en gestión de proyectos y control de versiones para un flujo de trabajo colaborativo con Scrum, Git, GitHub y Postman.",
    "soft-skills-title": "Soft Skills",
    "soft-skills-description": "Soy autónoma, flexible y detallista. Disfruto del trabajo en equipo y del intercambio de ideas, siempre con la vista puesta en los objetivos comunes. Estoy siempre abierta a nuevas oportunidades para seguir creciendo en desarrollo web.",
    "soft-skills-autonomy": "Autonomía",
    "soft-skills-achievement-orientation": "Orientación al logro",
    "soft-skills-teamwork": "Trabajo en equipo"
  }
}